export const agnivanshData = [
    { id: 'abu_yagya', name: 'आबू यज्ञ', subtitle: 'वशिष्ठ का महायज्ञ', parent: 'vashistha', yug: 'kaliyug', parichay: 'आबू पर्वत पर म्लेच्छों के विनाश के लिए ऋषि वशिष्ठ और विश्वामित्र द्वारा किया गया महायज्ञ, जिससे 4 अग्निवंशी क्षत्रिय उत्पन्न हुए।' },
    { id: 'pratihara', name: 'प्रतिहार', subtitle: 'प्रथम अग्निवंशी', parent: 'abu_yagya', yug: 'kaliyug', parichay: 'अग्निकुंड से प्रकट होने वाले प्रथम वीर, जिन्होंने प्रतिहार (परिहार/गुर्जर-प्रतिहार) वंश की स्थापना की। इन्होने सदियों तक अरबों के आक्रमण से भारत की रक्षा की।' },
    { id: 'parmar', name: 'परमार', subtitle: 'द्वितीय अग्निवंशी', parent: 'abu_yagya', yug: 'kaliyug', parichay: 'अग्निकुंड से प्रकट होने वाले द्वितीय वीर, जिन्होंने परमार (पवार) वंश की स्थापना की। महान चक्रवर्ती सम्राट विक्रमादित्य और राजा भोज इसी वंश में हुए।' },
    { id: 'chalukya', name: 'चालुक्य', subtitle: 'तृतीय अग्निवंशी', parent: 'abu_yagya', yug: 'kaliyug', parichay: 'अग्निकुंड से प्रकट होने वाले तृतीय वीर, जिन्होंने चालुक्य (सोलंकी) वंश की स्थापना की।' },
    { id: 'chauhan', name: 'चौहान', subtitle: 'चतुर्थ अग्निवंशी', parent: 'abu_yagya', yug: 'kaliyug', parichay: 'अग्निकुंड से सबसे अंत में चार भुजाओं के साथ प्रकट होने वाले वीर, जिन्होंने चौहान (चाहमान) वंश की स्थापना की। पृथ्वीराज चौहान इसी वंश में हुए।' }
];
